app/Http/Controllers/CandidatureController.php

   public function index()
{
    $candidatures = Candidature::where('user_id', auth()->id())
        ->filter(request()->only(['statut', 'priorite']))
        ->with('entretiens:id,candidature_id,date_heure')
        ->withCount('entretiens')
        ->latest()
        ->paginate(15);
---
select `id`, `candidature_id`, `date_heure` from `entretiens` where `entretiens`.`candidature_id` in (3, 4)
select count(*) as aggregate from `candidatures` where `user_id` = 1 and `statut` = 'to_review' and `candidatures`.`deleted_at` is null

    public function show(Candidature $candidature)
    {
        $this->authorize('view', $candidature);

        $candidature->load('entretiens');
---
select * from `entretiens` where `entretiens`.`candidature_id` in (4)

    public function archives()
    {
        $candidatures = Candidature::onlyTrashed()
            ->where('user_id', auth()->id())
            ->get();
---
select * from `candidatures` where `candidatures`.`deleted_at` is not null and `user_id` = 2