app/Http/Controllers/DashboardController.php

    public function index()
    {
        $userId = auth()->id();

        // Nombre total de candidatures actives (non archivées)
        $totalActives = Candidature::where('user_id', $userId)->count();

        // Nombre d'entretiens à venir (date_heure >= maintenant)
        $entretiensAVenir = Entretien::whereHas('candidature', fn($q) => $q->where('user_id', $userId))
            ->where('date_heure', '>=', now())
            ->count();

        // Nombre de candidatures avec offre reçue
        $offresRecues = Candidature::where('user_id', $userId)
            ->where('statut', 'offer_received')
            ->count();

        // Nombre de candidatures archivées (soft deleted)
        $totalArchives = Candidature::onlyTrashed()
            ->where('user_id', $userId)
            ->count();

        // 5 dernières candidatures
        $recentCandidatures = Candidature::where('user_id', $userId)
            ->with('entretiens')
            ->latest()
            ->take(5)
            ->get();

        // 5 prochains entretiens à venir
        $prochainsEntretiens = Entretien::whereHas('candidature', fn($q) => $q->where('user_id', $userId))
            ->with('candidature')
            ->where('date_heure', '>=', now())
            ->orderBy('date_heure')
            ->take(5)
            ->get();

        // Répartition des candidatures par statut (pour graphique)
        $repartitionStatuts = Candidature::where('user_id', $userId)
            ->select('statut', DB::raw('count(*) as count'))
            ->groupBy('statut')
            ->pluck('count', 'statut');
---
select count(*) as aggregate from `candidatures` where `user_id` = 1 and `candidatures`.`deleted_at` is null
select count(*) as aggregate from `entretiens` where exists (select * from `candidatures` where `entretiens`.`candidature_id` = `candidatures`.`id` and `user_id` = 1 and `candidatures`.`deleted_at` is null) and `date_heure` >= '2026-05-30 09:47:20'
select count(*) as aggregate from `candidatures` where `user_id` = 1 and `statut` = 'offer_received' and `candidatures`.`deleted_at` is null
select count(*) as aggregate from `candidatures` where `candidatures`.`deleted_at` is not null and `user_id` = 1
select * from `candidatures` where `user_id` = 1 and `candidatures`.`deleted_at` is null order by `created_at` desc limit 5
select * from `entretiens` where `entretiens`.`candidature_id` in (3, 4)
select * from `candidatures` where `candidatures`.`id` in (3) and `candidatures`.`deleted_at` is null
select * from `entretiens` where exists (select * from `candidatures` where `entretiens`.`candidature_id` = `candidatures`.`id` and `user_id` = 1 and `candidatures`.`deleted_at` is null) and `date_heure` >= '2026-05-30 09:47:20' order by `date_heure` asc limit 5
select `statut`, count(*) as count from `candidatures` where `user_id` = 1 and `candidatures`.`deleted_at` is null group by `statut`